//app.js
//1:加载模块
const express = require("express");
const pool  = require("./pool");
//2:创建express对象
var app = express();
//服务器node.js 允许跨域访问配置项
//2.1:引入跨域模块   
const cors = require("cors");
//2.2:配置允许哪个程序跨域访问 脚手架   11:16
app.use(cors({
  origin:[
    "http://127.0.0.1:3001","http://localhost:3001"],
  credentials:true
}))

//3:指定静态目录
//服务器指定目录 绝对路径 出错
app.use(express.static(__dirname+"/public"));

//4:绑定监听端口
app.listen(3000);


//功能-零:完美商城首页底部栏
app.get("/index_list",(req,res)=>{
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/Home.png",title:"首页"},
    {id:2,img_url:"http://127.0.0.1:3000/img/wallet.png",title:"完美钱包"},
    {id:3,img_url:"http://127.0.0.1:3000/img/share.png",title:"分享"},
    {id:4,img_url:"http://127.0.0.1:3000/img/cart.png",title:"购物车"},
    {id:5,img_url:"http://127.0.0.1:3000/img/member.png",title:"个人中心"}
  ];
  res.send(obj)
});

//功能一：搜索框图片
app.get("/select",(req,res)=>{
  var obj = [
 {id:1,img_url:"http://127.0.0.1:3000/img/logo.png"},
 {id:2,img_url:"http://127.0.0.1:3000/img/scan.png"},
 {id:3,img_url:"http://127.0.0.1:3000/img/notice.png"},
];
  res.send(obj)
});

//功能二:完美商城首页图片轮播
//GET /imagelist   json
app.get("/imagelist",(req,res)=>{
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/5.jpg"},
    {id:2,img_url:"http://127.0.0.1:3000/img/1.jpg"},
    {id:3,img_url:"http://127.0.0.1:3000/img/2.jpg"},
    {id:4,img_url:"http://127.0.0.1:3000/img/3.jpg"},
    {id:5,img_url:"http://127.0.0.1:3000/img/4.jpg"},
  ];
  res.send(obj)
});

//功能三:完美商城首页八宫格
app.get("/bagongge",(req,res)=>{
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/product.png",title:"产品列表"},
    {id:2,img_url:"http://127.0.0.1:3000/img/member_order.png",title:"我的订单"},
    {id:3,img_url:"http://127.0.0.1:3000/img/invitation_customer.png",title:"邀请顾客"},
    {id:4,img_url:"http://127.0.0.1:3000/img/member_tea.png",title:"普洱茶购货"},
    {id:5,img_url:"http://127.0.0.1:3000/img/quick_shopping.png",title:"快速购货"},
    {id:6,img_url:"http://127.0.0.1:3000/img/gift_query.png",title:"礼券/优惠券"},
    {id:7,img_url:"http://127.0.0.1:3000/img/month_customer.png",title:"已邀请顾客"},
    {id:8,img_url:"http://127.0.0.1:3000/img/Services.png",title:"更多..."},
  ];
  res.send(obj)
});

//功能四:完美商城首页最新通告
app.get("/zuixin",(req,res)=>{
  var obj = [
    {id:1,title:"久香陈韵完美百家普洱茶(YPT... [2018-03-"},
    {id:2,title:"关于部分地区微信支付受限制的通知[2018-07-"},  
  ];
  res.send(obj)
});
//功能五:完美商城首页图片四宫格
app.get("/imagelist1",(req,res)=>{
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/category_1.png"},
    {id:2,img_url:"http://127.0.0.1:3000/img/category_2.png"},
    {id:3,img_url:"http://127.0.0.1:3000/img/category_3.png"},
    {id:4,img_url:"http://127.0.0.1:3000/img/category_4.png"}
  ];
  res.send(obj)
});

//功能六:完美商城首页图片四宫格
app.get("/imagelist1",(req,res)=>{
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/Home.png",title:"首页"},
    {id:2,img_url:"http://127.0.0.1:3000/img/wallet.png",title:"完美钱包"},
    {id:3,img_url:"http://127.0.0.1:3000/img/share.png",title:"分享"},
    {id:4,img_url:"http://127.0.0.1:3000/img/cart.png",title:"购物车"},
    {id:5,img_url:"http://127.0.0.1:3000/img/member.png",title:"个人中心"}
  ];
  res.send(obj)
});

//功能七:完美商城商品列表
app.get("/productlist",(req,res)=>{
  var id = req.query.id;
  var obj = [
    {id:1,img_url:"http://127.0.0.1:3000/img/ACC-1.jpg",title:"空调泡沫清新剂",details:"ACC",PV:64,price:75.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:2,img_url:"http://127.0.0.1:3000/img/AF131-1.jpg",title:"芦荟滋养护色洗发露",details:"AF131",PV:32,price:38.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:3,img_url:"http://127.0.0.1:3000/img/AF13118-1.jpg",title:"荟新芦荟滋养护色洗发露",details:"AF13118",PV:55,price:69.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:4,img_url:"http://127.0.0.1:3000/img/AF231-1.jpg",title:"芦荟滋养护色润发乳",details:"AF231",PV:32,price:38.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:5,img_url:"http://127.0.0.1:3000/img/AF23118-1.jpg",title:"荟新芦荟滋养护色润发乳",details:"AF23118",PV:30,price:39.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:6,img_url:"http://127.0.0.1:3000/img/AF232-1.jpg",title:"芦荟保湿修护润发乳",details:"AF232",PV:23,price:27.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:7,img_url:"http://127.0.0.1:3000/img/AF23218-1.jpg",title:"荟新芦荟保湿修护润发乳",details:"AF23218",PV:30,price:38.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:8,img_url:"http://127.0.0.1:3000/img/AF301-1.jpg",title:"荟新动感发胶",details:"AF301",PV:32,price:38.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:9,img_url:"http://127.0.0.1:3000/img/AF30118-1.jpg",title:"荟新动感定型啫喱",details:"AF30118",PV:14,price:19.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:10,img_url:"http://127.0.0.1:3000/img/AFSG1804-1.jpg",title:"荟新洗护四件套",details:"AFSG1804",PV:131,price:168.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:11,img_url:"http://127.0.0.1:3000/img/AG-1.jpg",title:"完美芦荟胶",details:"AG",PV:32,price:38.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:12,img_url:"http://127.0.0.1:3000/img/AG2-1.jpg",title:"芦荟胶优惠套装",details:"AG10",PV:281,price:330.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:13,img_url:"http://127.0.0.1:3000/img/AG10-1.jpg",title:"芦荟胶礼盒",details:"AC2",PV:59,price:70.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:14,img_url:"http://127.0.0.1:3000/img/AKCV-1.jpg",title:"亚卡纳海岸白葡萄酒",details:"AKCV",PV:238,price:298.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:15,img_url:"http://127.0.0.1:3000/img/AKCV006-1.jpg",title:"亚卡纳海岸白葡萄酒优惠装",details:"AKCV006",PV:1190,price:1490.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:16,img_url:"http://127.0.0.1:3000/img/AKCV1807-1.jpg",title:"海岸白豪礼装",details:"AKCV1807",PV:1190,price:1490.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:17,img_url:"http://127.0.0.1:3000/img/AKGB-1.jpg",title:"亚卡纳金装起泡葡萄酒",details:"AKGB",PV:304,price:380.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:18,img_url:"http://127.0.0.1:3000/img/AKGB006-1.jpg",title:"亚卡纳金装起泡葡萄酒优惠装",details:"AKGB006",PV:1520,price:1900.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:19,img_url:"http://127.0.0.1:3000/img/AKGB1807-1.jpg",title:"金装起泡豪礼装",details:"AKGB1807",PV:1520,price:1900.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:20,img_url:"http://127.0.0.1:3000/img/AKOV-1.jpg",title:"亚卡纳老藤红葡萄酒",details:"AKOV",PV:567,price:720.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:21,img_url:"http://127.0.0.1:3000/img/AKOV006-1.jpg",title:"亚卡纳老藤红葡萄酒优惠装",details:"AKOV006",PV:2835,price:3600.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:22,img_url:"http://127.0.0.1:3000/img/AKOV1801-1.jpg",title:"亚卡纳老藤红葡萄酒001",details:"AKOV1801",PV:0,price:10.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:23,img_url:"http://127.0.0.1:3000/img/AKOV1807-1.jpg",title:"老藤豪礼装",details:"AKOV1807",PV:2835,price:3600.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:24,img_url:"http://127.0.0.1:3000/img/AM007-1.jpg",title:"臻荟芦荟保湿舒缓面膜",details:"AM007",PV:143,price:168.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:25,img_url:"http://127.0.0.1:3000/img/AM0073001-1.jpg",title:"臻荟芦荟保湿舒缓面膜30片装",details:"AM0073001",PV:319,price:398.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:26,img_url:"http://127.0.0.1:3000/img/AMPN-1.jpg",title:"芦荟王浆矿物粉",details:"AMPN",PV:195,price:229.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>",describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:27,img_url:"http://127.0.0.1:3000/img/AMPN10-1.jpg",title:"完美牌芦荟王浆矿物粉优惠套装",details:"AMPN10",PV:1755,price:2061.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:28,img_url:"http://127.0.0.1:3000/img/AMPN30-1.jpg",title:"芦荟王浆矿物粉",details:"AMPN30",PV:218,price:256.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:29,img_url:"http://127.0.0.1:3000/img/AP181-1.jpg",title:"芦荟王浆矿物片",details:"AMT",PV:202,price:238.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:30,img_url:"http://127.0.0.1:3000/img/AP182-1.jpg",title:"宜悦空气净化器优惠装1",details:"AP181",PV:3570,price:5100.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:31,img_url:"http://127.0.0.1:3000/img/AP600-1.jpg",title:"宜悦空气净化器优惠装2",details:"AP182",PV:7070,price:10100.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:32,img_url:"http://127.0.0.1:3000/img/AP60018-1.jpg",title:" 宜悦空气净化器",details:"AP600",PV:7000,price:8750.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:33,img_url:"http://127.0.0.1:3000/img/APDGN1-1.jpg",title:"宜悦空气净化器优惠装3",details:"AP60018",PV:4860,price:7000.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:34,img_url:"http://127.0.0.1:3000/img/APDGN2-1.jpg",title:"空气净化机多功能过滤网第一代",details:"APDGN1",PV:735,price:980.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:35,img_url:"http://127.0.0.1:3000/img/APDGN101-1.jpg",title:"多功能过滤网优惠购",details:"APDGN101",PV:768,price:1276.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
    {id:36,img_url:"http://127.0.0.1:3000/img/APDGN201-1.jpg",title:"宜悦空气净化器复合过滤网",details:"APDGN2",PV:740,price:1480.00,describe:"\<p>有效去除空调蒸发器上的油及其它污染物，消除空气异味；\</p><p>自动分散空调上的固体粉尘；\</p><p>在空调蒸发器的翅片上形成保护膜，延长空调使用寿命；\</p><p>防止滤光板和金属框被腐蚀；气味芳香、清新自然；\</p><p>适用于家庭、医院、诊所、食物加工场等空调。\</p>"},
  ];
  res.send(obj)
})



